AucHouse/DataProcessors/РегистрацияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияПользователя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AucHouse/Enums/ТипПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продавец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AucHouse/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПользователя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AucHouse/DataProcessors/РегистрацияПользователя/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Зарегистрироваться(Команда)
	ЗарегистрироватьсяНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере()
	Если Пароль<>ПодтверждениеПароля Тогда 
		Сообщить("Пароли не совпадают!");
		Возврат;
	КонецЕсли;
	
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	
	НовыйПользователь.Имя = ФИО;
	НовыйПользователь.ПолноеИмя = ФИО;
	НовыйПользователь.ПоказыватьВСпискеВыбора = истина;
	
	НовыйПользователь.АутентификацияСтандартная = истина;
	НовыйПользователь.Пароль = Пароль;	
	Попытка 
		НовыйПользователь.Записать();
		
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ФИО;
	Пользователь.ТипПользователя = ТипПользователя;
	Пользователь.ЭлектроннаяПочта = ЭлектроннаяПочта;
	Пользователь.Телефон = Телефон;
	Пользователь.Адрес = Адрес;
	Пользователь.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Пароль.РежимПароля = истина;
	Элементы.ПодтверждениеПароля.РежимПароля = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если РольДоступнаАдминистратор() Тогда
		СтандартнаяОбработка = ложь;
		ДанныеВыбора = новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Покупатель"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Продавец"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаАдминистратор()
	Возврат не РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
